import Foundation


final class InfoCountryPresenter {
    var view: InfoCountryViewController?
    let model = InfoCountryModel(
                title1: "Общая информация", generalInfo: "Практически во всех крупных магазинах Финляндии действует система безналоговой торговли для туристов.  Во всех странах Европейского Союза в стоимость товара входит налог на добавочную стоимость (НДС), который, согласно законодательству стран ЕС, у Вас есть право вернуть при выезде из страны.",
                title2: "Как правильно оформить Tax Free?",
                title3: "I шаг", firstStep: "При покупке товара необходимо попросить продовца оформить TAX-FREE форму на возврат налога, при этом вам необходимо предъявить заграничный паспорт.  Продавец вносит в документ данные о покупке и ее стоимости. При заполнении необходимо указать адрес проживания, Ваши паспортные данные и поставить подпись. Продавец должен упаковать ваши приобретения. На выходе из магазина Вы получаете упакованные покупки, заполненные и подписанные квитанции с приложенными к ним чеками.",
                title4: "II шаг", secondStep: "Во время выезда из Финляндии, перед тем как пройти таможню, необходимо поставить штамп на чеках, которые вы получили в магазине. Также вам понадобится загранпаспорт. В некоторых случаях просят показать сам товар, который вы купили в Финляндии. Упаковка не должна быть нарушена, все бирки и ценники необходимо сохранить. Чеки нужно предъявить в специальное окошко на таможне, где ответственный за это сотрудник поставит на них штамп. После того, как чеки проштампованы, товары можно упаковать в багаж.",
                title5: "III шаг", thirdStep: "При пересечении финской границы в пунктах выдачи вы без труда получите наличными в евро сумму налога с совершенных покупок, если были соблюдены все вышеперечисленные правила. Можно попросить, чтобы оформили безналичный платеж. Для этого нужно заполнить специальное заявление, и необходимо учитывать, что деньги придут на вашу карту в течение 1-2 месяцев из-за перегруженности системы tax free. При себе необходимо иметь паспорт, квитанции с чеками и покупки в неповрежденной упаковке.",
                title6: "Где вернуть деньги?", lon: 37.620762, lat: 55.754064)
}

